package com.naver.lecture.ch03;

public class Operator {

	public static void main(String[] args) {
		
		// 연산의 방향
/*			<-- : right to left : 증감, 부호, 비트, 논리, 대입
			--> : left to right : 산술, 쉬프트, 비교, 논리, 조건 (일반적 방법)*/
			
		
		// 연산의 우선순위
//			증감(++, --), 부호(+, -), 비트(~), 논리(!)
//			산술(*, /, %)
//			산술(+, -)
//			쉬프트(>>, <<, >>>)
//			비교(<, >, <=, =>, instanceof)
//			비교(==, !=)
//			논리(&)
//			논리()^
//			논리(|)
//			논리(&&)
//			논리(||)
//			조건(?)
//			대입(=, +=, -=, *=, /=, %=, &=, ^=, |=, <<=, >>=, >>>=)
		
		// ***** ()로 적절히 우선 순위를 잡아서 사용하는 것이 중요 *****
		
		//	항 = 피연산자 = 데이터
		//	단항연산자
//				부호연산자 (+, -)
		
//				증감연산자 (++, --)
		
//				논리부정연산자 (!)
		
//				비트 반전 연산자 (~)
		//	이항연산자
				
		//	삼항연산자
		
		
	}

}
